{
  "about_headline": "About me",
  "about_intro": "I am Lukas Kahmann, developer and passionate gamer. Ever since my childhood, video games have fascinated me – first as a player, now increasingly as a developer. Designing the technical systems behind an engaging gameplay experience is especially exciting for me.",
  "tech_head": "Technical Experience & Practice",
  "tech_p1": "During my dual computer science studies at Ostfalia University of Applied Sciences, I focused intensively on various aspects of computer science. I gained practical experience in areas such as software engineering, web development, and databases, and became familiar with programming languages such as Java, C#, JavaScript, C++ and Python.",
  "tech_p2": "As part of my studies, I was involved in several projects in the field of Robotic Process Automation (RPA), applying my technical knowledge and deepening my skills in working with clients and technical requirements. Despite all the technical challenges, however, I realized that I lacked enthusiasm for this particular field.",
  "gamedev_head": "My Path into Game Development",
  "gamedev_p1": "Since early 2025, I have been focusing intensively on game development with Unreal Engine 5. The creative freedom, the immediate visual feedback, and the combination of technical and creative requirements have shown me that this is exactly the right field for me.",
  "gamedev_p2": "My goal is to create games that excite others as much as they excite me – to build systems that make the gameplay experience smooth, clear, and comprehensible, without having the game mechanics dominate the foreground.",
  "learning_head": "Learning Approach & Development",
  "learning_p1": "I take an autodidactic approach because it allows me to deeply understand and internalize complex topics. To educate myself in a targeted way, I regularly use platforms like Udemy, Coursera, YouTube, as well as specialized forums and Discord communities. <br>During this continuing education I have completed the following courses:",
  "course1_title": "Unreal Engine 5: The Complete Beginner’s Course",
  "course1_platform": "Udemy",
  "course2_title": "Unreal Engine 5: Intermediate Course",
  "course2_platform": "Udemy",
  "course3_title": "Introduction to Game Development with Unreal Engine",
  "course3_platform": "Coursera",
  "learning_p2": "Among other platforms, ChatGPT is a central tool in my learning process. I use ChatGPT not only for planning, idea generation, and documentation, but also actively as a sparring partner and 'rubber duck' when solving problems. This helps me to structure my thoughts, reflect on technical challenges, and question solution approaches – often already during the formulation.",
  "ue_focus_head": "Focus: Unreal Engine 5",
  "ue_focus_p1": "Currently, my main focus is on working with Unreal Engine 5. I made a conscious decision to use this engine, as it offers solo developers like me a comprehensive environment to build complex systems while achieving impressive visual results.",
  "ue_focus_p2": "With an eye on later use in the industry – for example, in studios working with UE5 – I consider it useful to further deepen my knowledge here. The strong community, a wealth of learning resources, and the modular structure of the engine help me to develop step by step and refine my own workflow.",
  "timeline_abitur": "Abitur",
  "timeline_studium": "Dual Computer Science Studies",
  "timeline_rpa": "RPA Developer",
  "timeline_gamedev": "Game Developer",
  "timeline_today" : "2025-Today"
}
