{
  "project_role": "Solo Developer",
  "about_project": "About the Project",
  "about_intro": "As part of my introduction to game development, I completed the Udemy course 'Unreal Engine 5: The Complete Beginner’s Course'. The goal was to learn the basics of Unreal Engine through a small puzzle game built with Blueprints. During the project, I implemented fundamental elements such as interaction, UI, collisions, trigger events, and win/lose conditions.",
  "project_info": "Project Info",
  "role_label": "Role:",
  "type_label": "Project Type:",
  "project_type": "Learning Project",
  "status_label": "Status:",
  "project_status": "Completed",

  "learning_goals_head": "Learning Goals & Background",
  "learning_goals": "My goal for the first project in Unreal Engine 5 was to create a structured, manageable game by rebuilding a course project and step by step understanding how a functional level is constructed. It was particularly important to me to deepen my understanding of Blueprints and various game mechanics.",

  "gameplay_head": "Gameplay",
  "gameplay_intro": "The structure of the game is intentionally kept simple: The player starts at the beginning of a linear corridor and must reach a locked door at the end. However, the door only opens once three orbs have been collected. On the way, the player encounters various obstacles that must be overcome.",

  "fire_barrier_head": "Fire Barrier",
  "fire_barrier_text": "The barrier causes damage on contact and is meant to encourage the player to overcome the obstacle using a staircase. While crossing this section, the player automatically collects the first orb. The visual fire effect was implemented using assets from the Unreal Starter Content.",

  "platforms_head": "Floating Platforms",
  "platforms_text": "Vertically moving platforms allow the player to cross a gap and collect the second orb. Falling into the pit results in death.",

  "enemy_spheres_head": "Enemy Spheres",
  "enemy_spheres_text": "Spheres patrol narrow passages and block the player's path. They deal damage upon contact.",

  "game_over_head": "Game Over",
  "game_over_text": "If the player's health drops to zero or they fall into the void, the game ends. A Game Over screen appears with options to restart or quit.",

  "door_head": "Locked Door",
  "door_text": "At the end of the level, there is a door that only opens once all three orbs have been collected. The third orb is located in one of four identical houses passed on the way. If the player attempts to open the door without all three orbs, a message appears. Only once all three orbs have been collected can the door be opened and the level completed. A Victory screen appears after passing through the door.",

  "features_head": "Implemented Features",
  "feature1": "Health system with UI-based health display",
  "feature2": "Damage from collisions with enemy objects",
  "feature3": "Feedback via text messages and HUD",
  "feature4": "Game Over and Victory screens with restart/quit options",
  "feature5": "Movable platforms and obstacles via Timelines",
  "feature6": "Interaction-based door opening with condition check",
  "feature7": "Use of Unreal Starter Content for effects",

  "reflection_head": "Reflection",
  "reflection_text": "Despite the course's predefined structure, I learned a lot by implementing and adapting mechanics independently. The project was a valuable foundation for developing my own ideas and helped me understand how to work with Blueprints, events, and UI elements in Unreal. The clear structure and repeated testing were especially helpful."
}
